from tkinter import *
from tkinter.font import Font,BOLD

#function checkfile ถ้าเครื่องuser ยังไม่มีไฟล์historeyจะทำการสร้างใหม่
# โดยใช้try except มาช่วย หากเจอไฟล์จะอยู๋ในเงื่อนไขtry คือจะทำการอ่านแล้วปิดไม่ทำอะไร
# หากไม่เจอไฟล์จะอยู่ในเงื่อนไขexcept  คือจะทำการสร้างไฟล์ว่างให้
def checkfile():
    try:
        #หาไฟล์
        fr = open("History.txt", "r", encoding="utf-8")
        fr.read()
        fr.close()
    except FileNotFoundError:
        #สร้างfile
        fw = open("History.txt", "w", encoding="utf-8")
        fw.close()
#run checkfile in main page
checkfile()
#variable num ไว้นับจำนวนครั้งที่เล่น
num = 1
#อ่านไฟล์ แล้วใช้loop for เพื่อดึงเอาจำนวนครั้งออกมา เพื่อเช็คว่าเล่นไปกี่ครั้งแล้ว หากเจอจะทำการ+1เพื่อนับเป็นครั้งต่อจากครั้งที่แล้ว
# try บวก1เข้าไป หมายถึง รอบต่อจากครั้งที่แล้ว ex. เจอ1แสดงว่าเล่นไป1ครั้งแล้ว ก็จะทำการ+1 เพื่อเก็บเข้าประวัติว่าครั้งที่จะเล่นคือครั้งที่2
# ถ้าเช็คแล้วไม่เจออะไรเลย คือNameError ก็จะทำการpass และใช้ตัวแปรเดิมที่เซ็ตไว้คือ1 เพราะไม่เจออะไรเลยก็คือว่าในไฟล์ว่างหรือยังไม่เคยเล่นสักครั้ง
fr = open("History.txt", "r", encoding="utf-8")
for line in fr.readlines():
    time = line[:1].strip()
try:
    num = time
    num = int(num)+1
except NameError:
    pass
fr.close


#create tkinter
root = Tk()
# setting attribute
root.attributes('-fullscreen', True)
root.title("Quizion Mark")
root.configure(bg="#F796CE")

#set font stype color
my_Font = Font(family='Microsoft Yahei UI Light')
FONT_QUIZ = ('Microsoft Yahei UI Light', 40)
FONT_CHOICE = ('Microsoft Yahei UI Light', 35)
BACKGROUND_COLOR = '#F796CE'

#variable ไว้เก็บลำดับข้อคำถาม , เก็บคะแนนรวม ,เก็บชื่อผู้ใช้
q = 1
point = 0
name = ""

#import photo in mainpage
logo = PhotoImage(file="logo.png")
play_btn = PhotoImage(file="play.png")

#import photo in menu
mathbtn = PhotoImage(file="math.png")
sciencebtn = PhotoImage(file="science.png")
engbtn = PhotoImage(file="eng.png")
placebtn = PhotoImage(file="place.png")

#import level choice
btn_easy = PhotoImage(file="easy.png")
btn_mediuum = PhotoImage(file="medium.png")
btn_hard = PhotoImage(file="hard.png")

#import photo in score
logo = PhotoImage(file="logo.png")
btn_next = PhotoImage(file="btn_next1.png")
btn_hard = PhotoImage(file="hard.png")

#import photo in history page
mp_photo = PhotoImage(file="mainpage_btn.png")
group_btn = PhotoImage(file="group_btn.png")
score_btn = PhotoImage(file="score_btn.png")
time_btn = PhotoImage(file="time_btn.png")
next_btn = PhotoImage(file="mainpage_btn.png")


#function show score
def show_score():
    global point
    #Font
    FONT_SCORE = ('Microsoft Yahei UI Light', 86)
    FONT_TEXT = ('Microsoft Yahei UI Light', 50, BOLD)
    #create frame เพื่อกำหนดขอบเขต
    frame_logo5 = Frame(root,width=600, height=380, bg=BACKGROUND_COLOR)
    frame_logo5.pack(anchor=N,pady=5)
    frame_text5 = Frame(root,width=500, height=220, bg=BACKGROUND_COLOR)
    frame_text5.pack(anchor=N,pady=5)
    frame_button5 = Frame(root,width=400, height=300, bg=BACKGROUND_COLOR)
    frame_button5.pack(anchor=N,pady=20)
    
    #show logo
    my_label = Label(frame_logo5, image=logo, bg=BACKGROUND_COLOR)
    my_label.place(x=50, y=-40)

    # #set variable sum_sumscore , content
    
    content_score = str(point)+" คะแนน"
    # #Label score text
    score_text = Label(frame_text5, text=content_score, fg='black', bg='#F796CE', font=FONT_SCORE)
    score_text.place(x=20,y=90)
    # #Label text
    text = Label(frame_text5, text='ทำได้', fg='black', bg='#F796CE', font=FONT_TEXT)
    text.place(x=160, y=10)
    #function clear score
    def clear_score_page():
        frame_logo5.destroy()
        frame_button5.destroy()
        frame_text5.destroy()
    def next_to_summary():
        clear_score_page()
        history_page()
        
    # #button
    next = Button(frame_button5, image=btn_next, bg=BACKGROUND_COLOR, cursor='hand2', activebackground=BACKGROUND_COLOR, borderwidth=0, command=next_to_summary)
    next.place(x=50, y=60)
    Button(width=20, pady=7, text='ออกจากโปรแกรม', bg='red', fg='white', border=0, cursor='hand2',
        font=(my_Font,11), command=root.quit).place(x=1300, y=20)

def history_page():
    #reset variable
    global q
    global point
    global num
    num += 1
    q = 1
    point = 0
    
    # labelHis = Label(winhis,text=fr.read(),fg='black',bg='white',font=('Microsoft Yahei UI Light',11),pady=5,justify=LEFT).place(y=50,x=15)
    #set content name เพื่อสะดวกต่อการใช้งาน และใช้method .capitalize เพื่อให้ตัวแรกของชื่อเป็นตัวใหญ่
    content_name = "ประวัติการเล่นของ: "+str(name.capitalize())
    def clear_history_page():
        my_frame.destroy()
        text_frame.destroy()
        button_frame.destroy()
    #goto mainpage
    def goto_mainpage():
        clear_history_page()
        mainpage()
    # frame 
    my_frame = Frame(root, bg=BACKGROUND_COLOR, height=150, width=1200)
    my_frame.place(x=420,y=40)
    text_frame = Frame(root, bg=BACKGROUND_COLOR, height=590, width=1400)
    text_frame.place(x=70,y=160)
    button_frame = Frame(root, bg=BACKGROUND_COLOR, height=100, width=400)
    button_frame.place(x=550,y=760)
    frame_col1 = Frame(text_frame, bg=BACKGROUND_COLOR, height=490, width=200)
    frame_col1.place(x=100,y=100)
    frame_col2 = Frame(text_frame, bg=BACKGROUND_COLOR, height=490, width=600)
    frame_col2.place(x=380,y=100)
    frame_col3 = Frame(text_frame, bg=BACKGROUND_COLOR, height=490, width=200)
    frame_col3.place(x=1070,y=100)

    # # # label หัวข้อ
    # # # ของ ... จะรับค่ามาจาก file
    Label(my_frame, text=content_name, font=(my_Font ,50), bg=BACKGROUND_COLOR, fg="white").pack(anchor=CENTER,pady=30)
    Label(text_frame, image=time_btn, bg=BACKGROUND_COLOR, fg="white").place(x=60, y=0)
    Label(text_frame, image=group_btn, bg=BACKGROUND_COLOR, fg="white").place(x=530, y=0)
    Label(text_frame, image=score_btn, bg=BACKGROUND_COLOR, fg="white").place(x=1030, y=0)
    fr = open("History.txt","r",encoding="utf-8")
    show_time = ""
    show_group = ""
    show_scoreh = ""
    for line in fr.readlines():
        time = line[:1].strip()
        group = line[1:24].strip()
        score = line[25:].strip()
        show_time = str(show_time)  + str(time)+ "\n"
        show_group = str(show_group)  + str(group)+ "\n"
        show_scoreh = str(show_scoreh)  + str(score)+ "\n"
    label_1 = Label(frame_col1, text=show_time, font=(my_Font ,36), bg=BACKGROUND_COLOR, fg="white").place(x=80,y=0)
    label_2 = Label(frame_col2, text=show_group,font=(my_Font ,36), bg=BACKGROUND_COLOR, fg="white").place(x=80,y=0)
    label_3 = Label(frame_col3, text=show_scoreh, font=(my_Font ,36), bg=BACKGROUND_COLOR, fg="white").place(x=80,y=0)
    fr.close()
    # # # label แสดงข้อมูลครั้งที่, หมวด, คะแนน ยังไม่เขียน function รับข้อมูลจาก file 
    # # # ตรง text ลองใส่ดูเฉยๆว่าเวลามีข้อความจะเป็นยังไง ของจริงจะรับมาจาก file
    
    # # button -> go to main page
    goto_mainpage = Button(button_frame, border=0, image=next_btn, bg="#f796c5", cursor='hand2', activebackground=BACKGROUND_COLOR,
                            command=goto_mainpage).place(x=0, y=2)
    
    # button -> exit
    Button(width=20,pady=7,text='ออกจากโปรแกรม',bg='red',fg='white',border=0,cursor='hand2',
        font=(my_Font,11),command=root.quit).place(x=1300,y=20)
        

def goto_menu_page():
    #function go to select level page
    def goto_select_level_page():
        #function clear level page
        def clear_level_page():
            frame_choice3.destroy()
            frame_title3.destroy()
        #set variable choice,level,content
        
        def choice_easy():
            global choice
            global level
            level = "ง่าย"
            clear_level_page()
            startquiz()

        def choice_normal():
            global choice
            global level
            level = "ปานกลาง"
            clear_level_page()
            startquiz()
        def choice_hard():
            global choice
            global level
            level = "ยาก"
            clear_level_page()
            startquiz()

        def startquiz():
            #question math
            questions_math_easy = {
                "1":{
                    "q":"38 + (16 + 15) มีค่าเท่ากับข้อใด",
                    "c1":"69",
                    "c2":"71",
                    "c3":"73",
                    "c4":"75",
                    "ans":"69"
                },
                "2":{
                    "q":"(46 - 8) - 11 มีค่าเท่ากับข้อใด",
                    "c1":"25",
                    "c2":"26",
                    "c3":"27",
                    "c4":"28",
                    "ans":"27"
                },
                "3":{
                    "q":"(26 + 44) - 30 มีค่าเท่ากับข้อใด",
                    "c1":"35",
                    "c2":"40",
                    "c3":"45",
                    "c4":"50",
                    "ans":"40"
                },
                "4":{
                    "q":"(25 × 3) + 37 มีค่าเท่ากับข้อใด",
                    "c1":"92",
                    "c2":"102",
                    "c3":"112",
                    "c4":"122",
                    "ans":"112"
                },
                "5":{
                    "q":"72 – (36 ÷ 6) มีค่าเท่ากับข้อใด",
                    "c1":"61",
                    "c2":"64",
                    "c3":"66",
                    "c4":"69",
                    "ans":"66"
                },
                "6":{
                    "q":"(65 + 35) – 73 มีค่าเท่ากับข้อใด",
                    "c1":"25",
                    "c2":"26",
                    "c3":"27",
                    "c4":"28",
                    "ans":"27"
                },
                "7":{
                    "q":"(21 × 3) + 96 มีค่าเท่ากับข้อใด",
                    "c1":"159",
                    "c2":"169",
                    "c3":"179",
                    "c4":"189",
                    "ans":"159"
                },
                "8":{
                    "q":"28 ÷ (100 – 96) มีค่าเท่ากับข้อใด",
                    "c1":"5",
                    "c2":"6",
                    "c3":"7",
                    "c4":"8",
                    "ans":"7"
                },
                "9":{
                    "q":"86 – (49 ÷ 7) มีค่าเท่ากับข้อใด",
                    "c1":"69",
                    "c2":"79",
                    "c3":"89",
                    "c4":"99",
                    "ans":"79"
                },
                "10":{
                    "q":"(25 × 4) ÷ 5 มีค่าเท่ากับข้อใด",
                    "c1":"15",
                    "c2":"20",
                    "c3":"25",
                    "c4":"30",
                    "ans":"20"
                }
             }
            questions_math_normal = {
                "1":{
                    "q":"จงหา ห.ร.ม. ของ 12,18",
                    "c1":"1",
                    "c2":"6",
                    "c3":"12",
                    "c4":"36",
                    "ans":"6"
                },
                "2":{
                    "q":"จงหาค่าประมาณของ 32,158 (ตอบเป็นจำนวนเต็มพัน)",
                    "c1":"30,000",
                    "c2":"32,000",
                    "c3":"32,158",
                    "c4":"34,000",
                    "ans":"32,000"
                },
                "3":{
                    "q":"จงหา ค.ร.น. ของ 12 และ 30",
                    "c1":"2",
                    "c2":"12",
                    "c3":"30",
                    "c4":"60",
                    "ans":"60"
                },
                "4":{
                    "q":"15% ของ 320 คือจำนวนใด",
                    "c1":"15",
                    "c2":"32",
                    "c3":"45",
                    "c4":"48",
                    "ans":"48"
                },
                "5":{
                    "q":"30 เป็นร้อยละเท่าใดของ 200",
                    "c1":"ร้อยละ 10",
                    "c2":"ร้อยละ 15",
                    "c3":"ร้อยละ 30",
                    "c4":"ร้อยละ 40",
                    "ans":"ร้อยละ 15"
                },
                "6":{
                    "q":"ตัวประกอบของ 24 มีทั้งหมดกี่จำนวน",
                    "c1":"16",
                    "c2":"7",
                    "c3":"8",
                    "c4":"9",
                    "ans":"8"
                },
                "7":{
                    "q":"20% ของ 570 คือจำนวนใด",
                    "c1":"20",
                    "c2":"57",
                    "c3":"114",
                    "c4":"228",
                    "ans":"114"
                },
                "8":{
                    "q":"40 เป็นร้อยละเท่าใดของ 800",
                    "c1":"ร้อยละ 5",
                    "c2":"ร้อยละ 10",
                    "c3":"ร้อยละ 15",
                    "c4":"ร้อยละ 20",
                    "ans":"ร้อยละ 5"
                },
                "9":{
                    "q":"32 สามารถแยกตัวประกอบได้อย่างไร",
                    "c1":"2x2x2x2x2",
                    "c2":"2x2x12",
                    "c3":"2x2x2x6",
                    "c4":"2x2x2x2x3",
                    "ans":"2x2x2x2x2"
                },
                "10":{
                    "q":"ข้อใดมีค่าเท่ากับ 0.512",
                    "c1":"5.12 x 10",
                    "c2":"51.2 x 0.1",
                    "c3":"512 x 0.01",
                    "c4":"512 x 0.001",
                    "ans":"512 x 0.001"
                }
             }
            questions_math_hard = {
                "1":{
                    "q":"ข้อใดเป็นคำตอบที่ถูกต้องของอสมการ 2 + 3t  <  5t  -  6",
                    "c1":"t  >  8",
                    "c2":"t  <  4",
                    "c3":"t  >  4",
                    "c4":"t  <  8",
                    "ans":"t  >  4"
                },
                "2":{
                    "q":"ข้อใดเป็นคำตอบที่ถูกต้องของอสมการ 3 + 2t  <  -7",
                    "c1":"t  <  5",
                    "c2":"t  <  -10",
                    "c3":"t  <  -5",
                    "c4":"t  >  8",
                    "ans":"t  <  -5"
                },
                "3":{
                    "q":"ข้อใดเป็นคำตอบที่ถูกต้องของอสมการ -1 - 8y  >  -2y + 5",
                    "c1":"y  <  -3",
                    "c2":"y  <  -1",
                    "c3":"y  >  -3",
                    "c4":"y  >  -1",
                    "ans":"y  <  -1"
                },
                "4":{
                    "q":"สมการใด ไม่ใช่ สมการเชิงเส้นสองตัวแปร",
                    "c1":"2/x = 4",
                    "c2":"4x = 1",
                    "c3":"xy = 0",
                    "c4":"5x – 6y = 3",
                    "ans":"5x – 6y = 3"
                },
                "5":{
                    "q":"คำตอบของระบบสมการ 2x–y = 5 และ 3x–2y = 11 ตรงกับข้อใด",
                    "c1":"(–1,–7)",
                    "c2":"(4,3)",
                    "c3":"(5,5)",
                    "c4":"(6,7)",
                    "ans":"(–1,–7)"
                },
                "6":{
                    "q":"กําหนด a = −2 , b = 3 , c = 4 จํานวนในข้อใดมีค่ามากที่สุด",
                    "c1":"(c−a)b",
                    "c2":"b + c − a",
                    "c3":"−abc",
                    "c4":"(a−b)c",
                    "ans":"−abc"
                },
                "7":{
                    "q":"โยนลูกเต๋า 2 ลุกพร้อมๆกัน ความน่าจะเป็นที่ลูกเต๋าทั้งสอง\nจะหงายหน้าต่างกัน ตรงกับข้อใด",
                    "c1":"1/6",
                    "c2":"1/2",
                    "c3":"2/3",
                    "c4":"5/6",
                    "ans":"5/6"
                },
                "8":{
                    "q":"โยนลูกเต๋า 3 ลูกพร้อมๆกัน ความน่าจะเป็นที่ลูกเต๋าทั้ง 3 ลูก\nจะขึ้นหน้าตรงกัน ตรงกับข้อใด",
                    "c1":"1/72",
                    "c2":"1/36",
                    "c3":"1/6",
                    "c4":"1/3",
                    "ans":"1/36"
                },
                "9":{
                    "q":"ครอบครัวหนึ่งวางแผนจะมีบุตร 3 คน ความน่าจะเป็น\nที่จะไม่ได้บุตรหญิง ตรงกับข้อใด",
                    "c1":"1/4",
                    "c2":"3/4",
                    "c3":"1/8",
                    "c4":"7/8",
                    "ans":"1/8"
                },
                "10":{
                    "q":"จงหาจำนวนแซมเปิลสเปซจากการทอยลูกเต๋า 1 ลูก\nพร้อมกับโยนเหรียญบาท 1 เหรียญพร้อมกัน",
                    "c1":"9",
                    "c2":"10",
                    "c3":"11",
                    "c4":"12",
                    "ans":"12"
                }
            }
            #----------------------------------------------------------------------------------------------------------
            #question science
            questions_sci_easy = {
                "1": {
                    "q": "สัญลักษณ์ H ในตารางธาตุคือธาตุชนิดใด",
                    "c1": "Hydrogen",
                    "c2": "Helium",
                    "c3": "Hafnium",
                    "c4": "Holmium",
                    "ans": "Hydrogen"
                },
                "2": {
                    "q": "สัตว์เลี้ยงลูกด้วยนมชนิดใดที่ออกลูกเป็นไข่",
                    "c1": "เต่า",
                    "c2": "ตุ่นปากเป็ด",
                    "c3": "เป็ด",
                    "c4": "โลมา",
                    "ans": "ตุ่นปากเป็ด"
                },
                "3": {
                    "q": "วาฬเป็นสัตว์ชนิดใด",
                    "c1": "สัตว์น้ำ",
                    "c2": "สัตว์เลื้อยคลาน",
                    "c3": "สัตว์ปีก",
                    "c4": "สัตว์เลี้ยงลูกด้วยนม",
                    "ans": "สัตว์เลี้ยงลูกด้วยนม"
                },
                "4": {
                    "q": "มนุษย์อาศัยอยู่ที่ส่วนใด",
                    "c1": "ข้างในโลก",
                    "c2": "บนพื้นผิวของโลก",
                    "c3": "ไม่ได้อยู่บนโลก",
                    "c4": "ได้ทั้งหมด",
                    "ans": "บนพื้นผิวของโลก"
                },
                "5": {
                    "q": "โลกมีรูปร่างอย่างไร",
                    "c1": "เกือบจะกลม",
                    "c2": "เกือบจะแบน",
                    "c3": "หัวใจ",
                    "c4": "รูปร่างใดก็ได้",
                    "ans": "เกือบจะกลม"
                },
                "6": {
                    "q": "ข้อใดเป็นสิ่งมีชีวิตทั้งหมด",
                    "c1": "มด ไก่ บ้าน",
                    "c2": "หญ้า แก้ว ลิง",
                    "c3": "หนอน ม้า เสือ",
                    "c4": "น้ำ สิงโต จาน",
                    "ans": "หนอน ม้า เสือ"
                },
                "7": {
                    "q": "ข้อใดเป็นผลกระทบจากการทำลายป่า",
                    "c1": "น้ำท่วม",
                    "c2": "ไฟป่า",
                    "c3": "ภัยแล้ง",
                    "c4": "ถูกทุกข้อ",
                    "ans": "ถูกทุกข้อ"
                },
                "8": {
                    "q": "ของใช้ในข้อใดต้องมีสมบัติในการกันน้ำได้ดี",
                    "c1": "เสื้อ",
                    "c2": "ร่ม",
                    "c3": "ผ้าเช็ดเท้า",
                    "c4": "หมวก",
                    "ans": "ร่ม"
                },
                "9": {
                    "q": "การละเล่นในข้อใดต้องใช้แรงดึง",
                    "c1": "เป่าหนังยาง",
                    "c2": "ชักเย่อ",
                    "c3": "ม้าก้านกล้วย",
                    "c4": "ขี่ม้าส่งเมือง",
                    "ans": "ชักเย่อ"
                },
                "10": {
                    "q": "การกระทำในข้อใดใช้แรงดึง",
                    "c1": "ชักธงชาติ",
                    "c2": "พับกระดาษ",
                    "c3": "กระโดด",
                    "c4": "เป่าเทียน",
                    "ans": "ชักธงชาติ"
                },
            }

            questions_sci_normal = {
                "1": {
                    "q": "ข้อใดไม่ใช่พลังงาน",
                    "c1": "ความร้อน",
                    "c2": "แสง",
                    "c3": "ลม",
                    "c4": "สี",
                    "ans": "สี"
                },
                "2": {
                    "q": "พืชชนิดใดมีรากอากาศ",
                    "c1": "ไทร",
                    "c2": "มะม่วง",
                    "c3": "เป็ด",
                    "c4": "หญ้าแฝก",
                    "ans": "ไทร"
                },
                "3": {
                    "q": "ใบของต้นกระบองเพชรเปลี่ยนเป็นหนามเพราะเหตุใด",
                    "c1": "เพื่อใช้ในการดักจับแมลง",
                    "c2": "เพื่อลดอัตราการคายน้ำ",
                    "c3": "เพื่อความสวยงาม",
                    "c4": "เพื่อให้ลำต้นได้รับแสงแดดได้เต็มที่",
                    "ans": "เพื่อลดอัตราการคายน้ำ"
                },
                "4": {
                    "q": "ข้อใดไม่ใช่วิธีการอนุรักษ์พันธุ์สัตว์ป่าที่ถูกวิธี",
                    "c1": "ไม่ล่าสัตว์",
                    "c2": "ไม่ทำลายป่า",
                    "c3": "ไม่บุกรุกป่า",
                    "c4": "นำสัตว์ป่ามาเลี้ยงที่บ้าน",
                    "ans": "นำสัตว์ป่ามาเลี้ยงที่บ้าน"
                },
                "5": {
                    "q": "สัตว์ชนิดใดมีอวัยวะที่ใช้หายใจแตกต่างจากพวก",
                    "c1": "สัตว์ปีก",
                    "c2": "สัตว์เลื้อยคลาน",
                    "c3": "ปลา",
                    "c4": "สัตว์เลี้ยวลูกด้วยนม",
                    "ans": "ปลา"
                },
                "6": {
                    "q": "ลูกอ๊อดหายใจโดยใช้อวัยวะใด",
                    "c1": "ท่ออากาศ",
                    "c2": "เหงือก",
                    "c3": "ปอด",
                    "c4": "ผิวหนัง",
                    "ans": "เหงือก"
                },
                "7": {
                    "q": "ตัวกลางในข้อใดเสียงเดินทางผ่านได้ดีที่สุด",
                    "c1": "ของแข็ง",
                    "c2": "ของเหลว",
                    "c3": "แก๊ส",
                    "c4": "ไม่มีข้อใดถูก",
                    "ans": "ของแข็ง"
                },
                "8": {
                    "q": "เสียงในข้อใดให้ความรู้สึกแตกต่างจากพวก",
                    "c1": "เสียงดนตรี",
                    "c2": "เสียงประทัด",
                    "c3": "เสียงร้องเพลง",
                    "c4": "เสียงนกร้อง",
                    "ans": "เสียงประทัด"
                },
                "9": {
                    "q": "ปรากฏการณ์ใดที่มีสถานะเป็นของแข็ง",
                    "c1": "เมฆ",
                    "c2": "ลูกเห็บ",
                    "c3": "หมอก",
                    "c4": "น้ำค้าง",
                    "ans": "ลูกเห็บ"
                },
                "10": {
                    "q": "การที่ไอน้ำกลายเป็นหยดน้ำเรียกว่าอะไร",
                    "c1": "การระเหย",
                    "c2": "การหลอมเหลว",
                    "c3": "การควบแน่น",
                    "c4": "การหลอมละลาย",
                    "ans": "การควบแน่น"
                },
                }

            questions_sci_hard = {
                "1": {
                    "q": "บริเวณใดมีความดันอากาศต่ำที่สุด",
                    "c1": "ภูเขา",
                    "c2": "ทะเล",
                    "c3": "พื้นดิน",
                    "c4": "ป่าไม้",
                    "ans": "ภูเขา"
                },
                "2": {
                    "q": "ในการทำสายไฟ นิยมใช้โลหะในข้อใดเพื่อให้นำไฟฟ้าได้ดีที่สุด",
                    "c1": "ทองคำ",
                    "c2": "ทองแดง",
                    "c3": "ดีบุก",
                    "c4": "นิกเกิล",
                    "ans": "ทองแดง"
                },
                "3": {
                    "q": "วัสดุในข้อใดควรนำมาทำฉนวนความร้อน",
                    "c1": "เงิน",
                    "c2": "ทองเหลือง",
                    "c3": "พลาสติก",
                    "c4": "อะลูมิเนียม",
                    "ans": "พลาสติก"
                },
                "4": {
                    "q": "การที่เรานำเพชรมาใช้ในการตัดกระจก เกี่ยวข้องกับสมบัติ\nของวัสดุข้อใด",
                    "c1": "ความหนาแน่น",
                    "c2": "ความยืดหยุ่น",
                    "c3": "ความเหนียว",
                    "c4": "ความแข็ง",
                    "ans": "ความแข็ง"
                },
                "5": {
                    "q": "สิ่งของในข้อใดมีความหนาแน่นน้อยกว่าน้ำ",
                    "c1": "ทัพพีโลหะ",
                    "c2": "ลูกแก้ว",
                    "c3": "ตะปู",
                    "c4": "โฟม",
                    "ans": "โฟม"
                },
                "6": {
                    "q": "เราจะทดสอบความยืดหยุ่นของวัสดุได้โดยวิธีใด",
                    "c1": "การออกแรงกระทำต่อวัสดุ",
                    "c2": "การใช้วัสดุอื่นมาขูดขีด",
                    "c3": "การนำไปลอยน้ำ",
                    "c4": "การนำไปลนไฟ",
                    "ans": "การออกแรงกระทำต่อวัสดุ"
                },
                "7": {
                    "q": "ข้อใดเป็นลักษณะที่ถูกถ่ายทอดทางพันธุกรรม",
                    "c1": "หูตึง",
                    "c2": "ตาบอด",
                    "c3": "แผลเป็น",
                    "c4": "สีผิว",
                    "ans": "สีผิว"
                },
                "8": {
                    "q": "สิ่งใดที่มีสารพันธุกรรมอยู่ภายใน",
                    "c1": "ยีน",
                    "c2": "ไขสันหลัง",
                    "c3": "เซลล์กล้ามเนื้อ",
                    "c4": "เม็ดเลือดแดง",
                    "ans": "ยีน"
                },
                "9": {
                    "q": "การผสมเทียมสัตว์ในข้อใดเป็นแบบปฏิสนธิภายนอก",
                    "c1": "กระบือ",
                    "c2": "ปลานิล",
                    "c3": "หมู",
                    "c4": "วัว",
                    "ans": "ปลานิล"
                },
                "10": {
                    "q": "เหตุใดจึงต้องมีการขยายพันธุ์สัตว์",
                    "c1": "เพื่อเพิ่มจำนวน",
                    "c2": "เพื่อให้เกิดสายพันธุ์ใหม่",
                    "c3": "เพื่อให้สัตว์มีรูปร่างเปลี่ยนไป",
                    "c4": "เพื่อให้สัตว์มี 2 เพศ ในตัวเดียวกัน",
                    "ans": "เพื่อเพิ่มจำนวน"
                },
                }
            #----------------------------------------------------------------------------------------------------------
            #question English
            questions_eng_easy = {
                #บัตร
                "1":{
                    "q":"Card แปลว่าอะไร",
                    "c1":"แผนที่", 
                    "c2":"หนังสือ", 
                    "c3":"บัตร", 
                    "c4":"กุญแจ",
                    "ans":"บัตร"
                },
                #สบายดี
                "2":{
                    "q":"Fine แปลว่าอะไร",
                    "c1":"สบายดี", 
                    "c2":"เหนื่อย", 
                    "c3":"สวัสดี", 
                    "c4":"ลาก่อน",
                    "ans":"สบายดี"
                },
                #แบตเตอรี่
                "3":{
                    "q":"Battery แปลว่าอะไร",
                    "c1":"เติมพลัง", 
                    "c2":"โทรศัพท์มือถือ", 
                    "c3":"คอมพิวเตอร์", 
                    "c4":"แบตเตอรี่",
                    "ans":"แบตเตอรี่"
                },
                #โทรศัพท์
                "4":{
                    "q":"Telephone แปลว่าอะไร",
                    "c1":"คอมพิวเตอร์", 
                    "c2":"โทรศัพท์", 
                    "c3":"สมุดเบอร์โทร", 
                    "c4":"หมายเลขโทรศัพท์",
                    "ans":"โทรศัพท์"
                },
                #ข้อความ
                "5":{
                    "q":"Message แปลว่าอะไร",
                    "c1":"ข้อความ", 
                    "c2":"กระดาษเปล่า", 
                    "c3":"ตัวอักษร", 
                    "c4":"ลายมือ",
                    "ans":"ข้อความ"
                },
                #ซื้อ
                "6":{
                    "q":"Buy แปลว่าอะไร",
                    "c1":"ซื้อ", 
                    "c2":"ขอ", 
                    "c3":"ยืม", 
                    "c4":"จับ",
                    "ans":"ซื้อ"
                },
                #ลูกค้า
                "7":{
                    "q":"Customer แปลว่าอะไร",
                    "c1":"เขียนใหม่", 
                    "c2":"กำหนดเอง", 
                    "c3":"ลูกชาย", 
                    "c4":"ลูกค้า",
                    "ans":"ลูกค้า"
                },
                #พนักงานเก็บเงิน
                "8":{
                    "q":"Cashier แปลว่าอะไร",
                    "c1":"พนักงานรักษาความปลอดภัย", 
                    "c2":"พนักงานเก็บเงิน", 
                    "c3":"พนักงานบัญชี", 
                    "c4":"พนักงานขายประกัน",
                    "ans":"พนักงานเก็บเงิน"
                },
                #ใบเสร็จ
                "9":{
                    "q":"Receipt แปลว่าอะไร",
                    "c1":"บัตรเชิญ", 
                    "c2":"เปลี่ยนใหม่", 
                    "c3":"ใบเสร็จ", 
                    "c4":"สัญญา",
                    "ans":"ใบเสร็จ"
                },
                #บริษัท
                "10":{
                    "q":"Company แปลว่าอะไร",
                    "c1":"บริษัท", 
                    "c2":"โรงเรียน", 
                    "c3":"ร้านขายคอมพิวเตอร์", 
                    "c4":"ร้านขายโทรศัพท์มือถือ",
                    "ans":"บริษัท"
                }
            }
            questions_eng_normal = {
                #อุบัติเหตุ
                "1":{
                    "q":"Accident แปลว่าอะไร",
                    "c1":"อุบัติเหตุ", 
                    "c2":"หนังสือ", 
                    "c3":"แผนที่", 
                    "c4":"กุญแจ",
                    "ans":"อุบัติเหตุ"
                },
                #สนามบิน
                "2":{
                    "q":"Airport แปลว่าอะไร",
                    "c1":"ช่องอากาศ", 
                    "c2":"เครื่องบิน", 
                    "c3":"สนามบิน", 
                    "c4":"โรงพยาบาล",
                    "ans":"สนามบิน"
                },
                #ที่อยู่
                "3":{
                    "q":"Address แปลว่าอะไร",
                    "c1":"ปลายทาง", 
                    "c2":"ที่อยู่", 
                    "c3":"เป้าหมาย", 
                    "c4":"เพิ่ม",
                    "ans":"ที่อยู่"
                },
                #ทำให้ประหลาดใจ
                "4":{
                    "q":"Amaze แปลว่าอะไร",
                    "c1":"ทำให้ง่วงนอน",
                    "c2":"กระเป๋า", 
                    "c3":"หนังสือ", 
                    "c4":"ทำให้ประหลาดใจ",
                    "ans":"ทำให้ประหลาดใจ"
                },
                #รถพยาบาล
                "5":{
                    "q":"Ambulance แปลว่าอะไร",
                    "c1":"รถดับเพลิง", 
                    "c2":"รถถัง", 
                    "c3":"รถตำรวจ", 
                    "c4":"รถพยาบาล",
                    "ans":"รถพยาบาล"
                },
                #ผ้าเช็ดหน้า
                "6":{
                    "q":"Napkin แปลว่าอะไร",
                    "c1":"ผ้าเช็ดเท้า", 
                    "c2":"เสื้อผ้า", 
                    "c3":"ผ้าเช็ดหน้า", 
                    "c4":"ผ้าม่าน",
                    "ans":"ผ้าเช็ดหน้า"
                },
                #สิ่งอำนวยความสะดวกอย่างมาก
                "7":{
                    "q":"boon  แปลว่าอะไร",
                    "c1":"ตัวปัญหา", 
                    "c2":"ช้อน", 
                    "c3":"ส้อม", 
                    "c4":"สิ่งอำนวยความสะดวกอย่างมาก",
                    "ans":"สิ่งอำนวยความสะดวกอย่างมาก"
                },
                #สัมภาษณ์
                "8":{
                    "q":"interview แปลว่าอะไร",
                    "c1":"ทิวทัศน์", 
                    "c2":"ข้อสอบ", 
                    "c3":"หนังสือ", 
                    "c4":"สัมภาษณ์",
                    "ans":"สัมภาษณ์"
                },
                #เขต
                "9":{
                    "q":"zone แปลว่าอะไร",
                    "c1":"ปลายทาง", 
                    "c2":"ชน", 
                    "c3":"เขต", 
                    "c4":"สถานที่",
                    "ans":"เขต"
                },
                #ปล่อย
                "10":{
                    "q":"abandon แปลว่าอะไร",
                    "c1":"ปล่อย", 
                    "c2":"จับมือ", 
                    "c3":"สัญญา", 
                    "c4":"กอด",
                    "ans":"ปล่อย"
                }
            }
            questions_eng_hard = {
                #วิเคราะห์
                "1":{
                    "q":"analyze แปลว่าอะไร",
                    "c1":"ข้อมูล", 
                    "c2":"อ่าน", 
                    "c3":"เรียน", 
                    "c4":"วิเคราะห์",
                    "ans":"วิเคราะห์"
                },
                #การสละสิทธิ์
                "2":{
                    "q":"pass{n.} นอกจากแปลว่าผ่านแล้ว ยังแปลว่าอะไร",
                    "c1":"ทำได้", 
                    "c2":"การสละสิทธิ์", 
                    "c3":"ทำไม่ได้", 
                    "c4":"ยืนยันสิทธิ์",
                    "ans":"การสละสิทธิ์"
                },
                #คาดการณ์
                "3":{
                    "q":"anticipate แปลว่าอะไร",
                    "c1":"เรียน", 
                    "c2":"งานวิจัย", 
                    "c3":"คาดไม่ถึง", 
                    "c4":"คาดการณ์",
                    "ans":"คาดการณ์"
                },
                #โบราณคดี
                "4":{
                    "q":"archaeologist แปลว่าอะไร",
                    "c1":"จิตรกร", 
                    "c2":"นักวิทยาศาสตร์", 
                    "c3":"โบราณคดี", 
                    "c4":"นักชีวะวิทยา",
                    "ans":"โบราณคดี"
                },
                #
                "5":{
                    "q":"nobleman แปลว่าอะไร",
                    "c1":"คนฉลาด", 
                    "c2":"คนไม่ดี", 
                    "c3":"คนไม่มีสติ", 
                    "c4":"คนชั้นสูง",
                    "ans":"คนชั้นสูง"
                },
                #หนังสือคู่มือต่างๆ
                "6":{
                    "q":"handbook แปลว่าอะไร",
                    "c1":"หนังสือคู่มือต่างๆ", 
                    "c2":"สมุดบันทึก", 
                    "c3":"หนังสือ", 
                    "c4":"กระดาษเปล่า",
                    "ans":"หนังสือคู่มือต่างๆ"
                },
                #ความประสงค์
                "7":{
                    "q":"Requirement  แปลว่าอะไร",
                    "c1":"ความอันตราย", 
                    "c2":"ความน่ากลัว", 
                    "c3":"ความปลอดภัย", 
                    "c4":"ความประสงค์",
                    "ans":"ความประสงค์"
                },
                #ประสิทธิผล
                "8":{
                    "q":"Effectiveness แปลว่าอะไร",
                    "c1":"ความประสงค์", 
                    "c2":"ข้อเสีย", 
                    "c3":"ประสิทธิผล", 
                    "c4":"ความปลอดภัย",
                    "ans":"ประสิทธิผล"
                },
                #เครื่องหมาย
                "9":{
                    "q":"symbol แปลว่าอะไร",
                    "c1":"ผลลัพธ์",
                    "c2":"เครื่องหมาย", 
                    "c3":"ตัวเลข", 
                    "c4":"คำถาม",
                    "ans":"เครื่องหมาย"
                },
                #การตีความ
                "10":{
                    "q":"interpretation แปลว่าอะไร",
                    "c1":"การสละสิทธิ์",
                    "c2":"การปรบมือ", 
                    "c3":"การทำงาน", 
                    "c4":"การตีความ",
                    "ans":"การตีความ"
                }
            }
            #----------------------------------------------------------------------------------------------------------
            #question place
            questions_place_easy = {
                "1":{
                    "q": "เมอร์ไลออนอยู่ที่ประเทศใด",
                    "c1": "เวียดนาม",
                    "c2": "มาเลเซีย",
                    "c3": "สิงคโปร์",
                    "c4": "ฮ่องกง",
                    "ans": "สิงคโปร์"
                },
                "2":{
                    "q": "ยอดเขาที่สูงที่สุดในโลกคือยอดเขาใด",
                    "c1": "ยอดเขาก็อดวิน ออสเท็น",
                    "c2": "ภูเขามาคาลู",
                    "c3": "ภูเขาโชโอยู",
                    "c4": "ยอดเขาเอเวอร์เรสต์",
                    "ans": "ยอดเขาเอเวอร์เรสต์"
                },
                "3":{
                    "q": "อนุสาวรีย์เทพีเสรีภาพอยู่ที่ประเทศใด",
                    "c1": "สหรัฐอเมริกา",
                    "c2": "อังกฤษ",
                    "c3": "สเปน",
                    "c4": "ออสเตรเลีย",
                    "ans": "สหรัฐอเมริกา"
                },
                "4":{
                    "q": "เกาะที่ขนาดใหญ่ที่สุดในประเทศไทยคือเกาะใด",
                    "c1": "เกาะล้าน",
                    "c2": "เกาะเสม็ด",
                    "c3": "เกาะภูเก็ต",
                    "c4": "เกาะช้าง",
                    "ans": "เกาะภูเก็ต"
                },
                "5":{
                    "q": "หอไอเฟลอยู่ที่ประเทศใด",
                    "c1": "อิตาลี",
                    "c2": "ฝรั่งเศส",
                    "c3": "นิวซีแลนด์",
                    "c4": "กรีนแลนด์",
                    "ans": "ฝรั่งเศส"
                },
                "6":{
                    "q": "แม่น้ำคงคาอยู่ที่ประเทศใด",
                    "c1": "ศรีลังกา",
                    "c2": "เนปาล",
                    "c3": "ซาอุดิอาราเบีย",
                    "c4": "อินเดีย",
                    "ans": "อินเดีย"
                },
                "7":{
                    "q": "กำแพงเมืองที่ยาวที่สุดในโลกคือกำแพงอะไร",
                    "c1": "กำแพงอัล-บิรัก",
                    "c2": "กำแพงฮวาซอง",
                    "c3": "กำแพงเมืองจีน",
                    "c4": "กำแพงเบอร์ลิน",
                    "ans": "กำแพงเมืองจีน"
                },
                "8":{
                    "q": "ภูเขาไฟฟูจิอยู่ที่ประเทศใด",
                    "c1": "ญี่ปุ่น",
                    "c2": "เกาหลีใต้",
                    "c3": "ไต้หวัน",
                    "c4": "ฮ่องกง",
                    "ans": "ญี่ปุ่น"
                },
                "9":{
                    "q": "มหาวิทยาลัยที่เก่าแก่ที่สุดในประเทศไทยคือที่ใด",
                    "c1": "มหาวิทยาลัยมหิดล",
                    "c2": "จุฬาลงกรณ์มหาวิทยาลัย",
                    "c3": "มหาวิทยาลัยธรรมศาสตร์",
                    "c4": "มหาวิทยาลัยเกษตรศาสตร์",
                    "ans": "จุฬาลงกรณ์มหาวิทยาลัย"
                },
                "10":{
                    "q": "สวนสัตว์เปิดเขาเขียวอยู่ที่จังหวัดใด",
                    "c1": "ชลบุรี",
                    "c2": "ขอนแก่น",
                    "c3": "เชียงใหม่",
                    "c4": "ปทุมธานี",
                    "ans": "ชลบุรี"
                }
            }
            questions_place_normal ={
                "1":{
                    "q": "ประเทศที่มีพื้นที่มากที่สุดในโลก",
                    "c1": "รัสเซีย",
                    "c2": "อินโดนีเซีย",
                    "c3": "สหรัฐอเมริกา",
                    "c4": "จีน",
                    "ans": "รัสเซีย"
                },
                "2":{
                    "q": "ดินแดนที่อยู่ใต้สุดของประเทศไทยอยู่ที่จังหวัดใด",
                    "c1": "พังงา",
                    "c2": "นครศรีธรรมราช",
                    "c3": "กระบี่",
                    "c4": "ยะลา",
                    "ans": "ยะลา"
                },
                "3":{
                    "q": "ดินแดนที่อยู่เหนือสุดของประเทศไทยอยู่ที่จังหวัดใด",
                    "c1": "เชียงใหม่",
                    "c2": "ลำพูน",
                    "c3": "พะเยา",
                    "c4": "เชียงราย",
                    "ans": "เชียงราย"
                },
                "4":{
                    "q":"จังหวัดที่มีพื้นที่น้อยที่สุดในประเทศไทยคือจังหวัดใด",
                    "c1": "สมุทรสาคร",
                    "c2": "สมุทรสงคราม",
                    "c3": "สมุทรปราการ",
                    "c4": "กรุงเทพมหานคร",
                    "ans": "สมุทรสงคราม"
                },
                "5":{
                    "q": "สถานที่ที่ผู้คนเชื่อว่าเป็นสถาปัตยกรรมแห่งความรักที่สวยที่สุด\nในโลกคือที่ใด",
                    "c1": "ทะเลสาบวานาก้า",
                    "c2": "ทัชมาฮาล",
                    "c3": "เมืองวิลนีอุส",
                    "c4": "สวนลอยบาบิโลน",
                    "ans": "ทัชมาฮาล"
                },
                "6":{
                    "q": "เมืองที่ใหญ่ที่สุดของประเทศจีนคือเมืองอะไร",
                    "c1": "ปักกิ่ง",
                    "c2": "ฮาร์บิน",
                    "c3": "เซี่ยงไฮ้",
                    "c4": "ยูนนาน",
                    "ans": "เซี่ยงไฮ้"
                },
                "7":{
                    "q": "เกาะบาหลีอยู่ที่ประเทศใด",
                    "c1": "อินโดนีเซีย",
                    "c2": "ฟิลิปปินส์",
                    "c3": "มาเลเซีย",
                    "c4": "ไทย",
                    "ans": "อินโดนีเซีย"
                },
                "8":{
                    "q": "เมืองหลวงของประเทศเกาหลีเหนือมีชื่อว่าอะไร",
                    "c1": "ยงซาน",
                    "c2": "เปียงยาง",
                    "c3": "ชองโฮ",
                    "c4": "จินอัน",
                    "ans": "เปียงยาง"
                },
                "9":{
                    "q": "มอสโกเป็นเมืองหลวงของประเทศใด",
                    "c1": "บราซิล",
                    "c2": "สวีเดน",
                    "c3": "รัสเซีย",
                    "c4": "โปแลนด์",
                    "ans": "รัสเซีย"
                },
                "10":{
                    "q": "ภูทับเบิกอยู่ที่จังหวัดอะไร",
                    "c1": "แม่ฮ่องสอน",
                    "c2": "เลย",
                    "c3": "มุกดาหาร",
                    "c4": "เพชรบูรณ์",
                    "ans": "เพชรบูรณ์"
                }
            }
            questions_place_hard = {
                "1":{
                    "q": "เมืองที่ได้รับฉายาว่าราชินีแห่งทะเลเอเดรียติกคือเมืองอะไร",
                    "c1": "เวนิส",
                    "c2": "ปิซ่า",
                    "c3": "อัมสเตอร์ดัม",
                    "c4": "เฮลซิงกิ",
                    "ans": "เวนิส"
                },
                "2":{
                    "q": "สวนสาธารณะที่มีพื้นที่มากที่สุดในกรุงเทพมหานครคือที่ใด",
                    "c1": "สวนจตุจักร",
                    "c2": "สวนเสรีไทย",
                    "c3": "สวนหลวง ร.๙",
                    "c4": "สวนลุมพินี",
                    "ans": "สวนหลวง ร.๙"
                },
                "3":{
                    "q": "หอคอยอลิซาเบธคือชื่ออย่างเป็นทางการของสถานที่ใด",
                    "c1": "เคแอลทาวเวอร์",
                    "c2": "หอนาฬิกาบิ๊กเบน",
                    "c3": "ตึกเบิร์จคาลิฟา",
                    "c4": "ตึกเวิลด์เทรด",
                    "ans": "หอนาฬิกาบิ๊กเบน"
                },
                "4":{
                    "q": "รูปปั้นพระเยซูคริสต์ที่ได้เป็น1ใน7สิ่งมหัศจรรย์ของโลกยุคใหม่\nอยู่ที่ประเทศใด",
                    "c1": "บราซิล",
                    "c2": "เม็กซิโก",
                    "c3": "เปรู",
                    "c4": "จอร์เจีย",
                    "ans": "บราซิล"
                },
                "5":{
                    "q": "นครเพตราอยู่ที่ประเทศใด",
                    "c1": "ศรีลังกา",
                    "c2": "นอร์เวย์",
                    "c3": "จอร์แดน",
                    "c4": "กัมพูชา",
                    "ans": "จอร์แดน"
                },
                "6":{
                    "q": "เมืองที่นักประวัติศาสตร์และนักโบราณคดีตั้งฉายาให้ว่า\nบาบิโลนแห่งใหม่คือเมืองใด",
                    "c1": "ลาบายู",
                    "c2": "ยิปลัน",
                    "c3": "พัจตา",
                    "c4": "นิเนเวห์",
                    "ans": "นิเนเวห์"
                },
                "7":{
                    "q": "เมืองสาบสูญแห่งอินคา หรือ มาชูปิกชูอยู่ที่ประเทศใด",
                    "c1": "อิสราเอล",
                    "c2": "เปรู",
                    "c3": "ยูเครน",
                    "c4": "อียิปต์",
                    "ans": "เปรู"
                },
                "8":{
                    "q": "สนามกีฬาโบราณกลางแจ้งขนาดใหญ่ที่ตั้งอยู่ใจกลางกรุงโรม\nมีชื่อว่าอะไร",
                    "c1": "โอลึมเพียซตาดิโยน",
                    "c2": "วิลลาพาร์ก",
                    "c3": "โคลอสเซียม",
                    "c4": "พาลาเอสทรา",
                    "ans": "โคลอสเซียม"
                },
                "9":{
                    "q": "สถานที่ที่เคยเป็นโบสถ์ที่ใหญี่ที่สุดในโลกในประเทศตุรกี\nมีชื่อว่าอะไร",
                    "c1": "ฮาเกียโซเฟีย",
                    "c2": "ฮาลิคาร์นัสเซิส",
                    "c3": "มารากานัง",
                    "c4": "พานาทิไนโค",
                    "ans": "ฮาเกียโซเฟีย"
                },
                "10":{
                    "q": "พีระมิดคูฟูหรือพีระมิดคีออปส์ นิยมเรียกกันโดยทั่วไปว่าอะไร",
                    "c1": "พีระมิดชีเชนอิตซา",
                    "c2": "พีระมิดซิกกุรัต",
                    "c3": "มหาพีระมิดแห่งกีซา",
                    "c4": "พีระมิดโจเซอร์",
                    "ans": "มหาพีระมิดแห่งกีซา"
                }
            }

            #----------------------------------------------------------------------------------------------------------

            def quiz():
                global q
                q = str(q)
                # Create frame
                frame_question = Frame(root, width=1350, height=450, bg=BACKGROUND_COLOR)
                frame_question.pack(anchor=N, pady=0)
                frame_choice = Frame(root, width=1400, height=400, bg=BACKGROUND_COLOR)
                frame_choice.pack(anchor=N, pady=5)
                frame_showlevel = Frame(root, width=300, height=60, bg=BACKGROUND_COLOR)
                frame_showlevel.place(x=1190,y=100)
                def clear_quiz():
                    frame_question.destroy()
                    frame_choice.destroy()
                    frame_showlevel.destroy()
                def select_choice():
                    global q
                    global question
                    global choice1
                    global choice2
                    global choice3
                    global choice4
                    global ans
                    if choice == "คณิตศาสตร์":
                        if level == "ง่าย":
                            question = questions_math_easy[q]["q"]
                            choice1 = questions_math_easy[q]["c1"]
                            choice2 = questions_math_easy[q]["c2"]
                            choice3 = questions_math_easy[q]["c3"]
                            choice4 = questions_math_easy[q]["c4"]
                            ans = questions_math_easy[q]["ans"]
                        elif level == "ปานกลาง":
                            question = questions_math_normal[q]["q"]
                            choice1 = questions_math_normal[q]["c1"]
                            choice2 = questions_math_normal[q]["c2"]
                            choice3 = questions_math_normal[q]["c3"]
                            choice4 = questions_math_normal[q]["c4"]
                            ans = questions_math_normal[q]["ans"]
                        elif level == "ยาก":
                            question = questions_math_hard[q]["q"]
                            choice1 = questions_math_hard[q]["c1"]
                            choice2 = questions_math_hard[q]["c2"]
                            choice3 = questions_math_hard[q]["c3"]
                            choice4 = questions_math_hard[q]["c4"]
                            ans = questions_math_hard[q]["ans"]
                            
                    elif choice == "วิทยาศาสตร์":
                        if level == "ง่าย":
                            question = questions_sci_easy[q]["q"]
                            choice1 = questions_sci_easy[q]["c1"]
                            choice2 = questions_sci_easy[q]["c2"]
                            choice3 = questions_sci_easy[q]["c3"]
                            choice4 = questions_sci_easy[q]["c4"]
                            ans = questions_sci_easy[q]["ans"]
                        elif level == "ปานกลาง":
                            question = questions_sci_normal[q]["q"]
                            choice1 = questions_sci_normal[q]["c1"]
                            choice2 = questions_sci_normal[q]["c2"]
                            choice3 = questions_sci_normal[q]["c3"]
                            choice4 = questions_sci_normal[q]["c4"]
                            ans = questions_sci_normal[q]["ans"]
                        elif level == "ยาก":
                            question = questions_sci_hard[q]["q"]
                            choice1 = questions_sci_hard[q]["c1"]
                            choice2 = questions_sci_hard[q]["c2"]
                            choice3 = questions_sci_hard[q]["c3"]
                            choice4 = questions_sci_hard[q]["c4"]
                            ans = questions_sci_hard[q]["ans"]
                    elif choice == "ภาษาอังกฤษ":
                        if level == "ง่าย":
                            question = questions_eng_easy[q]["q"]
                            choice1 = questions_eng_easy[q]["c1"]
                            choice2 = questions_eng_easy[q]["c2"]
                            choice3 = questions_eng_easy[q]["c3"]
                            choice4 = questions_eng_easy[q]["c4"]
                            ans = questions_eng_easy[q]["ans"]
                        elif level == "ปานกลาง":
                            question = questions_eng_normal[q]["q"]
                            choice1 = questions_eng_normal[q]["c1"]
                            choice2 = questions_eng_normal[q]["c2"]
                            choice3 = questions_eng_normal[q]["c3"]
                            choice4 = questions_eng_normal[q]["c4"]
                            ans = questions_eng_normal[q]["ans"]
                        elif level == "ยาก":
                            question = questions_eng_hard[q]["q"]
                            choice1 = questions_eng_hard[q]["c1"]
                            choice2 = questions_eng_hard[q]["c2"]
                            choice3 = questions_eng_hard[q]["c3"]
                            choice4 = questions_eng_hard[q]["c4"]
                            ans = questions_eng_hard[q]["ans"]
                    elif choice == "สถานที่":
                        if level == "ง่าย":
                            question = questions_place_easy[q]["q"]
                            choice1 = questions_place_easy[q]["c1"]
                            choice2 = questions_place_easy[q]["c2"]
                            choice3 = questions_place_easy[q]["c3"]
                            choice4 = questions_place_easy[q]["c4"]
                            ans = questions_place_easy[q]["ans"]
                        elif level == "ปานกลาง":
                            question = questions_place_normal[q]["q"]
                            choice1 = questions_place_normal[q]["c1"]
                            choice2 = questions_place_normal[q]["c2"]
                            choice3 = questions_place_normal[q]["c3"]
                            choice4 = questions_place_normal[q]["c4"]
                            ans = questions_place_normal[q]["ans"]
                        elif level == "ยาก":
                            question = questions_place_hard[q]["q"]
                            choice1 = questions_place_hard[q]["c1"]
                            choice2 = questions_place_hard[q]["c2"]
                            choice3 = questions_place_hard[q]["c3"]
                            choice4 = questions_place_hard[q]["c4"]
                            ans = questions_place_hard[q]["ans"]
                def change_question():
                    global point
                    global q
                    # global ans
                    q = int(q)
                    q += 1
                    q = str(q)
                    
                    clear_quiz()
                    if int(q) <= 10 :
                        quiz()
                    else:
                        show_score()
                        fw = open("History.txt", "a", encoding="utf-8")
                        fw.writelines(str(f"{num:1} {content_level} {point:12} \n"))
                        fw.close()
                def check_point1():
                    global point
                    global q
                    q = str(q)
                    select_choice()
                    if choice1 == ans:
                        global point
                        point += 1
                    else:
                        pass

                    change_question()
                def check_point2():
                    global point
                    global q
                    q = str(q)
                    select_choice()
                    if choice2 == ans:
                        point += 1
                    else:
                        pass
                    change_question()
                def check_point3():
                    global point
                    global q
                    q = str(q)
                    select_choice()
                    if choice3 == ans:
                        point += 1
                    else:
                        pass

                    change_question()
                def check_point4():
                    global point
                    global q
                    q = str(q)
                    select_choice()
                    if choice4 == ans:
                        point += 1
                    else:
                        pass
                      
                    change_question()
                select_choice()
                global choice1
                global choice2
                global choice3
                global choice4
                content_level = (str(choice) + ":" + level)
                question_text = Label(frame_question, text=question, fg='black', bg=BACKGROUND_COLOR, font=FONT_QUIZ)
                question_text.place(x=20, y=300)
                choice1 = Button(frame_choice,text=choice1, font=FONT_CHOICE, bg="#fdd8ed", border=0,justify='center',command=check_point1).place(x=10, y=40, width=650, height=129)
                choice2 = Button(frame_choice,text=choice2, font=FONT_CHOICE, bg="#fdd8ed", border=0,justify='center',command=check_point2).place(x=740, y=40, width=650, height=129)
                choice3 = Button(frame_choice,text=choice3, font=FONT_CHOICE, bg="#fdd8ed", border=0,justify='center',command=check_point3).place(x=10, y=200, width=650, height=129)
                choice4 = Button(frame_choice,text=choice4, font=FONT_CHOICE, bg="#fdd8ed", border=0,justify='center',command=check_point4).place(x=740, y=200, width=650, height=129)
                show_level = Label(frame_showlevel, width=25, pady=5, height=2, text=content_level, bg='pink', fg='black', border=0, font=(my_Font, 15))
                show_level.pack(anchor=CENTER)
                Button(width=5,pady=7,text='X',bg='red',fg='white',border=0,cursor='hand2',
                font=(my_Font,11),command=root.quit).place(x=1430,y=20)
            quiz()
            

        #create frame
        frame_title3 = Frame(root,width=1000, height=150, bg=BACKGROUND_COLOR)
        frame_title3.place(x=300, y=50)
        frame_choice3 = Frame(root, width=1200, height=700, bg=BACKGROUND_COLOR)
        frame_choice3.place(x=170, y=150)
        
        #Label Head title
        head = Label(frame_title3,text ="เลือกระดับความยากของเกม", font=('Microsoft Yahei UI Light', 60), bg="#f796c5", fg="White",).pack(anchor='center')
            
        #choice
        easy = Button(frame_choice3,border=0, image=btn_easy, bg="#f796c5", cursor='hand2',activebackground=BACKGROUND_COLOR, command=choice_easy).place(x=200, y=30)
        normal = Button(frame_choice3,border=0, image=btn_mediuum, bg="#f796c5",cursor='hand2',activebackground=BACKGROUND_COLOR, command=choice_normal).place(x=200, y=250) 
        hard = Button(frame_choice3,border=0, image=btn_hard, bg="#f796c5", cursor='hand2',activebackground=BACKGROUND_COLOR, command=choice_hard).place(x=200, y=480)

        Button(width=20, pady=7,text='ออกจากโปรแกรม', bg='red', fg='white', border=0, cursor='hand2',
            font=(my_Font,11), command=root.quit).place(x=1300, y=20)



    #function clear menu page
    def clear_page_manu():
        frame_title1.destroy()
        frame_choice.destroy()
    #A function to select the math level page of the math.
    def choice_math():
        global choice
        clear_page_manu()
        goto_select_level_page()
        choice = "คณิตศาสตร์"

    #A function to select the math level page of the science.
    def choice_science():
        global choice
        clear_page_manu()
        goto_select_level_page()
        choice = "วิทยาศาสตร์"
    #A function to select the math level page of the eng.
    def choice_eng():
        global choice
        clear_page_manu()
        goto_select_level_page()
        choice = "ภาษาอังกฤษ"
    #A function to select the math level page of the place.
    def choice_place():
        global choice
        clear_page_manu()
        goto_select_level_page()
        choice = "สถานที่"


    #create frame
    frame_title1 = Frame(root, width=700, height=150, bg="#f796c5")
    frame_title1.pack(anchor=N,pady=50)
    frame_choice = Frame(root, width=1200, height=600, bg="#f796c5")
    frame_choice.pack(anchor=N, pady=30)
    #Label Head title
    head = Label(frame_title1, text ="เลือกหมวดคำถาม", font=('Microsoft Yahei UI Light', 60), bg="#f796c5", fg="White").pack(anchor=N)

    #choice
    mode1 = Button(frame_choice, borderwidth=0, image=mathbtn, width=620, height=220, cursor='hand2', command=choice_math)
    mode1.grid(row=0, column=0)

    mode2 = Button(frame_choice, borderwidth=0, image=sciencebtn, width=620, height=220, cursor='hand2', command=choice_science)
    mode2.grid(row=0, column=1, padx=30)

    mode3 = Button(frame_choice,borderwidth=0, image=engbtn,width=620, height=220, cursor='hand2', command=choice_eng)
    mode3.grid(row=1, column=0, pady=50)

    mode4 = Button(frame_choice,borderwidth=0, image=placebtn, width=620, height=220, cursor='hand2', command=choice_place)
    mode4.grid(row=1, column=1, padx=30, pady=50)

    Button(width=20,pady=7,text='ออกจากโปรแกรม',bg='red',fg='white',border=0,cursor='hand2',
        font=(my_Font,11), command=root.quit).place(x=1300, y=20)

def mainpage():
    name_text = StringVar()
    # name = StringVar()
    def get_name():
        global name
        if name_text.get() == "Enter your name." or name_text.get() == " ":
            name = "ไม่ระบุชื่อผู้ใช้"
        else:
            name = name_text.get()

    def startIspressed():
        #run get_name
        get_name()
        frame_logo.destroy()
        frame_button.destroy()
        frame_name.destroy()
        goto_menu_page()

    frame_logo = Frame(root, width=700, height=500, bg=BACKGROUND_COLOR)
    frame_logo.pack(anchor=N,pady=70)
    frame_button = Frame(root, width=500, height=150, bg=BACKGROUND_COLOR)
    frame_button.pack(anchor=N, pady=20)
    frame_name = Frame(root, width=600, height=100, bg=BACKGROUND_COLOR)
    frame_name.place(x=470, y=540)
    
    my_label = Label(frame_logo,image=logo,bg=BACKGROUND_COLOR,height=400,pady=300)
    my_label.place(y=70, x=100)
    
    btn = Button(frame_button, borderwidth=0, image=play_btn, bg=BACKGROUND_COLOR, cursor='hand2',
    activebackground=BACKGROUND_COLOR,command=startIspressed)
    btn.pack(anchor=N)

    def on_enter(e):
        user.delete(0,END)
    def on_leave(e):
        name = user.get()
        if name == '':
            user.insert(0,'Enter your name.')

    user = Entry(frame_name, width=22, fg='white', border=0, bg=BACKGROUND_COLOR, font=('Microsoft Yahei UI Light', 36), textvariable=name_text, justify='center')
    user.place(x=0, y=10)
    user.insert(0,'Enter your name.')
    user.bind('<FocusIn>',on_enter)
    user.bind('<FocusOut>',on_leave)

    Frame(frame_name,width=600, height=2, bg='black').place(x=0, y=80)
 
mainpage()

Button(width=20, pady=7, text='ออกจากโปรแกรม', bg='red', fg='white', border=0, cursor='hand2',
font=(my_Font, 11), command=root.quit).place(x=1300, y=20)

root.mainloop()